---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ServiceName
source: html/5b21fca4-97da-09bb-9f83-c26c0741940a.htm
---
# Autodesk.Revit.DB.FabricationPart.ServiceName Property

The name of the service associated with the fabrication part.

## Syntax (C#)
```csharp
public string ServiceName { get; }
```